# KilojoulesPerSquareMeterKelvin Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..KilojoulesPerSquareMeterKelvin Property
UnitTypeId Class See Also
---
Kilojoules per square meter Kelvin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KilojoulesPerSquareMeterKelvin { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KilojoulesPerSquareMeterKelvin As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KilojoulesPerSquareMeterKelvin {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace